In [1]:
import pandas as pd
import numpy as np
import math

# sql
import pandas.io.sql as pd_sql
from sqlalchemy import create_engine
import psycopg2 as pg

# plotting
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
#set the rc parameters
plt.style.use('ggplot')
plt.rc('font', size=18)

In [3]:
#crerate engine
engine = create_engine('postgresql://racheldilley:localhost@localhost:5432/programer_database')

Upload servey data as sql table "survey2020" to "programer_database"

In [4]:
# survey2020 = pd.read_csv('/Users/racheldilley/Documents/Metis/git_repos/coding-language-predictor/data/survey_results_public.csv')

# # name table survey2020
# survey2020.to_sql('survey2020', engine, index=False)

Upload region data as sql table "country_regions" to "programer_database"

In [5]:
country_regions_df = pd.read_csv('/Users/racheldilley/Documents/Metis/git_repos/coding-language-predictor/data/countries of the world.csv')

print(country_regions_df['Region'].value_counts())
# name table survey2020
#country_regions.to_sql('country_region', engine, index=False)

SUB-SAHARAN AFRICA                     51
LATIN AMER. & CARIB                    45
WESTERN EUROPE                         28
ASIA (EX. NEAR EAST)                   28
OCEANIA                                21
NEAR EAST                              16
C.W. OF IND. STATES                    12
EASTERN EUROPE                         12
NORTHERN AFRICA                         6
NORTHERN AMERICA                        5
BALTICS                                 3
Name: Region, dtype: int64

Query columns from survey2020 where Hobbyist (the target data) is not null

In [27]:
query = '''
SELECT "Hobbyist","MainBranch", "Age", "Age1stCode",  "Country", "DatabaseWorkedWith" as databases, 
"DevType", "EdLevel", "Employment", "Ethnicity", "Gender", "MiscTechWorkedWith" as developertools,
"NEWLearn" as Learn, "OpSys", "LanguageWorkedWith" as Language, "UndergradMajor", 
"WebframeWorkedWith" as Webframes, "YearsCode", "YearsCodePro"
FROM survey2020
WHERE "LanguageWorkedWith" IS NOT NULL;
'''
df = pd.read_sql_query(query, engine)

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 57378 entries, 0 to 57377
Data columns (total 19 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Hobbyist        57378 non-null  object
 1   MainBranch      57218 non-null  object
 2   Age             45028 non-null  float64
 3   Age1stCode      54146 non-null  object
 4   Country         57378 non-null  object
 5   databases       49298 non-null  object
 6   DevType         46243 non-null  object
 7   EdLevel         53407 non-null  object
 8   Employment      57107 non-null  object
 9   Ethnicity       45494 non-null  object
 10  Gender          49998 non-null  object
 11  developertools  40180 non-null  object
 12  learn           55129 non-null  object
 13  OpSys           55535 non-null  object
 14  language        57378 non-null  object
 15  UndergradMajor  47495 non-null  object
 16  webframes       42142 non-null  object
 17  YearsCode       53955 non-null  object
 18  YearsCodePro    43283 non-null  object
dtypes: float64(1), object(18)
memory usage: 8.3+ MB

### Data Cleaning

Expand df so there is only one top coding language per column

In [28]:
def get_languages_df(row, columns, str_list, idx):
    '''
    A function that turns a list in a column into multiple rows

    Parameters
    ----------
    row : row of df
    columns: columns of df
    str_list: list fo strings that will be included as rows
    idx: col index of list 

    Returns
    -------
    a df 
    '''
    df_devs = pd.DataFrame(columns=columns)
    col_list = row[idx].split(';') #create list from row value
    
    #loop through list and add to append value to df if value in str_list
    for val in col_list:
        if val in str_list:
            row[idx]= val #row to be changed to single value
            df_devs = df_devs.append(pd.DataFrame({'Hobbyist': row[0], 'MainBranch': row[1], 'Age': row[2], 
                                                   'Age1stCode': row[3], 'Country': row[4], 'databases': row[5],
                                                   'DevType': row[6], 'EdLevel': row[7], 'Employment': row[8],
                                                  'Ethnicity': row[9], 'Gender': row[10], 'developertools': row[11],
                                                   'learn': row[12], 'OpSys': row[13], 'language': row[14], 
                                                   'UndergradMajor': row[15], 'webframes': row[16], 'YearsCode': row[17],
                                                  'YearsCodePro': row[18]}, index=[index]), ignore_index=True)
    return df_devs

In [29]:
columns = df.columns
df2 = pd.DataFrame(columns=columns)
top_langs = ['JavaScript', 'Python', 'SQL', 'Java', 'HTML/CSS']

#loop through all cols in df and concat df from function to newly created df
for index, row in df.iterrows():
    df_devtypes = get_languages_df(row, columns, top_langs, 14)
    df2 = pd.concat([df2, df_devtypes], axis=0)
    #print(df2)

In [30]:
#investigate target data
df2['language'].value_counts()

JavaScript    38822
HTML/CSS      36181
SQL           31413
Python        25287
Java          23074
Name: language, dtype: int64

Change columsn to numeric

In [31]:
df3 = df2.copy()
num_cols = ['Age',  'Age1stCode', 'YearsCode', 'YearsCodePro']
for col in num_cols:
    df3[col] = df3[col].apply(pd.to_numeric, errors='coerce')

Clean EdLevel

In [32]:
def get_education(row):
    '''
    A function that shortens survey responses to get categorical features
    combines masters and doctorates and secondary and primary schooling

    Parameters
    ----------
    row : row of df

    Returns
    -------
    a str to update the EdLevel column in df
    '''
    try:
        if 'Bachelor' in row[7]:
            return 'Bachelors'
        elif 'Master' in row[7] or 'doctoral' in row[7]:
            return 'Masters/Doctoral'
        elif 'Secondary' in row[7] or 'Primary' in row[7]:
            return 'Secondary/Primary'
        elif 'Associate' in row[7]:
            return 'Associate'
        elif 'Professional' in row[7]:
            return 'Professional'
        elif 'Some' in row[7]:
            return 'Some College'
        else:
            return 'None'
    except:
        return row[7]

In [33]:
df3['EdLevel'] = df3.apply(get_education, axis=1) #update EdLevel column
df3['EdLevel'].value_counts()

Bachelors            67481
Masters/Doctoral     34758
Some College         19106
Secondary/Primary    14977
Associate             4882
Professional          2046
None                  1015
Name: EdLevel, dtype: int64

Clean Ethnicity

In [34]:
#change values with value counts less than 150 to other
c = df3['Ethnicity'].value_counts()
df3['Ethnicity'] = np.where(df3['Ethnicity'].isin(c.index[c<150]), 'other', df3['Ethnicity'])

In [35]:
def get_ethnicity(row):
    '''
    A function that shortens survey responses to get categorical features
    combines asian ethnicities and changes multi to multiracial

    Parameters
    ----------
    row : row of df

    Returns
    -------
    a str to update the Ethnicity column in df
    '''
    try:
        if 'Asian' in row[9]:
            return 'Asian'
        elif 'Hispanic' in row[9] and 'White' in row[9]:
            return 'other'
        elif 'Middle' in row[9] and 'White' in row[9]:
            return 'other'
        elif 'Black' in row[9]:
            return 'Black'
        elif 'Hispanic' in row[9]:
            return 'Hispanic'
        elif 'White' in row[9]:
            return 'White'
        elif 'Middle' in row[9]:
            return 'Middle Eastern'
        else:
            return 'other'
    except:
        return row[9]

In [36]:
df3['Ethnicity'] = df3.apply(get_ethnicity, axis=1) #update Ethnicity column
df3['Ethnicity'].value_counts()

White             78400
Asian             21671
other              7940
Hispanic           6372
Black              4762
Middle Eastern     4299
Name: Ethnicity, dtype: int64

Clean Gender column

In [37]:
#change values with value counts less than 1000 to gender non-conforming
c = df3['Gender'].value_counts()
df3['Gender'] = np.where(df3['Gender'].isin(c.index[c<1100]), 'gender non-conforming', df3['Gender'])
df3['Gender'].value_counts()

Man                      123350
Woman                     10201
gender non-conforming      1936
Name: Gender, dtype: int64

Create new DatabasesUsed column from databases column

In [38]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 154777 entries, 0 to 3
Data columns (total 19 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Hobbyist        154777 non-null  object
 1   MainBranch      154385 non-null  object
 2   Age             122185 non-null  float64
 3   Age1stCode      145411 non-null  float64
 4   Country         154777 non-null  object
 5   databases       141785 non-null  object
 6   DevType         124668 non-null  object
 7   EdLevel         144265 non-null  object
 8   Employment      154086 non-null  object
 9   Ethnicity       123444 non-null  object
 10  Gender          135487 non-null  object
 11  developertools  116064 non-null  object
 12  learn           149222 non-null  object
 13  OpSys           149893 non-null  object
 14  language        154777 non-null  object
 15  UndergradMajor  128141 non-null  object
 16  webframes       127309 non-null  object
 17  YearsCode       144423 non-null  float64
 18  YearsCodePro    110868 non-null  float64
dtypes: float64(4), object(15)
memory usage: 23.6+ MB

In [39]:
def get_num_databases(row):
    '''
    A function that returns the number of databases used 

    Parameters
    ----------
    row : row of df

    Returns
    -------
    a numerical value representing the number of databases used
    '''
    if row[5] is None:
        return 0
    
    database_list = row[5].split(';')
    return len(database_list)

In [40]:
df3['database_count'] = df3.apply(get_num_databases, axis=1) #add values to database_count column
df3['database_count'].value_counts()
#df['learn'].value_counts()

2     34434
1     31108
3     29128
4     19911
0     12992
5     12330
6      7090
7      3891
8      2002
9       962
10      404
14      236
11      173
12       66
13       50
Name: database_count, dtype: int64

Clean UndergradMajor column

In [41]:
def get_major(row):
    '''
    A function that shortens survey responses to get categorical features
    combines some majors together

    Parameters
    ----------
    row : row of df

    Returns
    -------
    a str to update the Ethnicity column in df
    '''
    try:
        if 'Computer' in row[15]:
            return 'Comp Sci/Eng'
        elif 'engineering' in row[15]:
            return 'Engineering'
        elif 'Web' in row[15]:
            return 'Web Dev'
        elif 'health' in row[15] or 'natural' in row[15]:
            return 'Health/Natural Science'
        elif 'Math' in row[15]:
            return 'Math/Stats'
        elif 'Information' in row[15]:
            return 'Information Tech/Sys'
        elif 'arts' in row[15]:
            return 'Arts'
        elif 'humanities' in row[15] or 'social' in row[15]:
            return 'Humanities/Social Sciences'
        elif 'never' in row[15]:
            return 'None'
        else:
            return float('NaN')
    except:
        return row[15]

In [43]:
df3['UndergradMajor'] = df3.apply(get_major, axis=1) #add values to UndergradMajor column
df3['UndergradMajor'].value_counts()

Comp Sci/Eng                  82110
Engineering                   10516
Information Tech/Sys          10452
Health/Natural Science         5427
Humanities/Social Sciences     4779
Web Dev                        4577
Math/Stats                     4171
Arts                           1793
None                           1115
Name: UndergradMajor, dtype: int64

Create new region column based on Country column

In [44]:
#group regions df by region
country_regions_df['Country'] = country_regions_df['Country'].str.strip() #left&right strip country col before grouping
country_regions_df['Region'] = country_regions_df['Region'].str.strip() #left&right stripregion col before grouping

regions_grouped = country_regions_df.groupby('Region')['Country']

#create region dict for correct names
region_dict = {
                'SUB-SAHARAN AFRICA' : 'Africa',
                'LATIN AMER. & CARIB' : 'South America',
                'ASIA (EX. NEAR EAST)' : 'Asia',
                'WESTERN EUROPE' : 'West Europe',
                'OCEANIA' : 'Australia',
                'NEAR EAST' :  'Middle East',
                'EASTERN EUROPE': 'East Europe',
                'C.W. OF IND. STATES' : 'Russia',
                'NORTHERN AFRICA' : 'Africa',
                'NORTHERN AMERICA' : 'North America',
                'BALTICS' : 'Baltics'
                }

In [45]:
def get_region(row):
    '''
    A function that shortens survey responses to get categorical features
    combines some majors together

    Parameters
    ----------
    row : row of df

    Returns
    -------
    a str to add region to region column in df
    '''
    #check if country exists in region df
    for group_name, df_group in regions_grouped:
        if row[4] in df_group.values:
            return region_dict[group_name]
    
    #check for missed values and return correct region if not nan value
    try:
        if 'Kong' in row[4] or 'Korea' in row[4] or 'Nam' in row[4] or 'Lao' in row[4]:
            return 'Asia'
        elif 'Congo' in row[4] or 'Gambia' in row[4] or 'Trinidad' in row[4] or 'Tanzania' in row[4] or 'CÃ´te' in row[4]:
            return 'Africa'
        elif 'Syria' in row[4] or 'Libya' in row[4] or 'Myanmar' in row[4] or 'Nomadic' in row[4]:
            return 'Middle East'
        elif 'Bosnia' in row[4] or 'Moldova' in row[4] or 'Macedonia' in row[4] or 'Kosovo' in row[4] or 'Montenegro' in row[4]:
            return 'East Europe'
        elif 'Venezuela' in row[4]:
            return 'South America'
        elif 'Russia' in row[4]:
            return 'Russia'
        else:
            return 'other'
    except:
        return row[4]

In [46]:
df3['Region'] = df3.apply(get_region, axis=1) #add values to region column
df3['Region'].value_counts()

West Europe      45668
North America    37952
Asia             31148
South America     9997
East Europe       9707
Africa            6523
Middle East       4563
Russia            4206
Australia         3909
Baltics           1078
other               26
Name: Region, dtype: int64

Combine MainCranch, DevType and Employment cols

In [47]:
def edit_DevType(row):
    '''
    A function that shortens survey responses to get categorical features
    combines some majors together

    Parameters
    ----------
    row : row of df

    Returns
    -------
    a str to add region to region column in df
    '''
    if row[6] is not None:
        dev_list = row[6].split(';')
        return [sub.replace('Developer, ', '') for sub in dev_list] 
        
    else:
        if row[1] is not None:
            if 'student' in row[1]:
                return ['Student']
            elif 'used to be' in row[1]:
                return ['Retired Dev']
            elif 'sometimes' in row[1]:
                return ['Sometimes Code at Work']
        elif row[8] is not None:
            return ['Other Occupation']
        else:
            return row[6]

In [49]:
df3['DevType'] = df3.apply(edit_DevType, axis=1) #add values to region column
#df['DevType'].value_counts().head(10)

In [50]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 154777 entries, 0 to 3
Data columns (total 21 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Hobbyist        154777 non-null  object
 1   MainBranch      154385 non-null  object
 2   Age             122185 non-null  float64
 3   Age1stCode      145411 non-null  float64
 4   Country         154777 non-null  object
 5   databases       141785 non-null  object
 6   DevType         142528 non-null  object
 7   EdLevel         144265 non-null  object
 8   Employment      154086 non-null  object
 9   Ethnicity       123444 non-null  object
 10  Gender          135487 non-null  object
 11  developertools  116064 non-null  object
 12  learn           149222 non-null  object
 13  OpSys           149893 non-null  object
 14  language        154777 non-null  object
 15  UndergradMajor  124940 non-null  object
 16  webframes       127309 non-null  object
 17  YearsCode       144423 non-null  float64
 18  YearsCodePro    110868 non-null  float64
 19  database_count  154777 non-null  int64
 20  Region          154777 non-null  object
dtypes: float64(4), int64(1), object(16)
memory usage: 26.0+ MB

Make DevTpes categories binary for top DevTypes

In [51]:
def add_binary_column(obj_list, str_search):
    try:
        for obj in obj_list:
            if str_search in obj:
                return 1
        return 0
    except:
        return obj_list

In [52]:
binary_columns = ['back-end', 'full-stack', 'front-end', 'desktop', 'mobile', 'DevOps', 'Database admin', 'Designer',
                 'System admin', 'Student', 'Other Occupation', 'Retired Dev','Sometimes Code at Work']
for col in binary_columns:
    x=0
    df3[col] = df3.apply(lambda x: add_binary_column(x['DevType'], col), axis=1)

drop uneeded or combined columns

In [53]:
df3.drop(labels=['Country', 'MainBranch', 'Employment', 'DevType', 'developertools', 'webframes', 'databases'
               ], axis=1, inplace=True)

In [56]:
df3.describe()

,Age,Age1stCode,YearsCode,YearsCodePro,database_count,back-end,full-stack,front-end,desktop,mobile,DevOps,Database admin,Designer,System admin,student,Other Occupation,Retired Dev
count,122185.000000,145411.000000,144423.000000,110868.000000,154777.000000,142528.000000,142528.000000,142528.000000,142528.000000,142528.000000,142528.000000,142528.000000,142528.000000,142528.000000,142528.0,142528.000000,142528.000000
mean,30.310544,15.237142,12.690382,8.821427,2.802703,0.519372,0.553442,0.364237,0.219823,0.171812,0.119885,0.122327,0.105095,0.108645,0.0,0.001066,0.004883
std,9.222797,4.908378,9.306356,7.646620,2.000669,0.499626,0.497137,0.481217,0.414128,0.377218,0.324828,0.327664,0.306677,0.311195,0.0,0.032639,0.069710
min,1.000000,5.000000,1.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.0,0.000000,0.000000
25%,24.000000,12.000000,6.000000,3.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.0,0.000000,0.000000
50%,28.000000,15.000000,10.000000,6.000000,2.000000,1.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.0,0.000000,0.000000
75%,35.000000,18.000000,17.000000,12.000000,4.000000,1.000000,1.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.0,0.000000,0.000000
max,99.000000,85.000000,50.000000,50.000000,14.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,0.0,1.000000,1.000000

Clean Age and Age1stCode column

In [61]:
df3 = df3[df3['Age'] < 70] #avg age of death is
df3 = df3[df3['Age1stCode'] < 60] #max was 85, which seems very unrealistic

df3['YearsCodePro'] = df3['YearsCodePro'].fillna(value=0)
df3.describe()

,Age,Age1stCode,YearsCode,database_count,back-end,full-stack,front-end,desktop,mobile,DevOps,Database admin,Designer,System admin,student,Other Occupation,Retired Dev
count,120874.000000,120874.000000,119677.000000,120874.000000,116031.000000,116031.000000,116031.000000,116031.000000,116031.000000,116031.000000,116031.000000,116031.000000,116031.000000,116031.0,116031.000000,116031.000000
mean,30.191777,15.088166,12.835265,2.795001,0.535995,0.573218,0.374495,0.224026,0.174686,0.125423,0.124932,0.102757,0.111496,0.0,0.000681,0.002999
std,8.938632,4.692101,9.197930,1.943842,0.498705,0.494612,0.483994,0.416941,0.379700,0.331200,0.330643,0.303643,0.314747,0.0,0.026084,0.054683
min,1.000000,5.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.0,0.000000,0.000000
25%,24.000000,12.000000,6.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.0,0.000000,0.000000
50%,28.000000,15.000000,10.000000,2.000000,1.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.0,0.000000,0.000000
75%,35.000000,18.000000,17.000000,4.000000,1.000000,1.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.0,0.000000,0.000000
max,69.000000,49.000000,50.000000,14.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,0.0,1.000000,1.000000

In [62]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 120874 entries, 0 to 0
Data columns (total 26 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Hobbyist          120874 non-null  object
 1   Age               120874 non-null  float64
 2   Age1stCode        120874 non-null  float64
 3   EdLevel           118296 non-null  object
 4   Ethnicity         110232 non-null  object
 5   Gender            119344 non-null  object
 6   learn             117012 non-null  object
 7   OpSys             119985 non-null  object
 8   language          120874 non-null  object
 9   UndergradMajor    102739 non-null  object
 10  YearsCode         119677 non-null  float64
 11  YearsCodePro      120874 non-null  object
 12  database_count    120874 non-null  int64
 13  Region            120874 non-null  object
 14  back-end          116031 non-null  float64
 15  full-stack        116031 non-null  float64
 16  front-end         116031 non-null  float64
 17  desktop           116031 non-null  float64
 18  mobile            116031 non-null  float64
 19  DevOps            116031 non-null  float64
 20  Database admin    116031 non-null  float64
 21  Designer          116031 non-null  float64
 22  System admin      116031 non-null  float64
 23  student           116031 non-null  float64
 24  Other Occupation  116031 non-null  float64
 25  Retired Dev       116031 non-null  float64
dtypes: float64(15), int64(1), object(10)
memory usage: 24.9+ MB

Pickle df2 to data folder

In [59]:
df3.to_pickle('../data/survey_data_cleaned.pkl')